src/cf/Documents/КвитанцияМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>КвитанцияМЭДО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументовМЭДО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГотоваКОтправке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКонверта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКвитанции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОшибки</Name>
					<Comment>Для входящих</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Для исходящей</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияСообщенийМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлена</Name>
					<Comment>Для исходящей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметКвитанцииМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеПринято</Name>
					<Comment>Для входящих</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияДокументовМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовМЭДО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Comment>Для входящего - из паспорта сообщения МЭДО, для исходящего - генерируется наш GUID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Comment>Для входящего из электронного сообщения. Для исходящего - генерируется системой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредметСообщения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметСообщенияМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовМЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияСообщенийМЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/НаправленияСообщенийМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НаправленияСообщенийМЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияДокументовМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияДокументовМЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВходящийДокументЗарегистрирован</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументЗарегистрированГотовКОтправке</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументОтправлен</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПолучен</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящееУведомлениеЕщеНеОтправлено</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящийДокументЕщеНеОтправлен</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящаяКвитанцияЕщеНеОтправлена</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаОтменена</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаКвитанция</Name>
					<Comment>Для входящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаКвитанцияОбОшибке</Name>
					<Comment>Для входящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоУведомление</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученаКвитанция</Name>
					<Comment>Для исходящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученаКвитанцияОбОшибке</Name>
					<Comment>Для исходящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоУведомление</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданаИсходящаяКвитанция</Name>
					<Comment>Для входящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданоИсходящееУведомление</Name>
					<Comment>для входящих документов</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/КвитанцияМЭДО/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ДанныеКонверта = Новый ХранилищеЗначения(Неопределено);
	ДанныеСообщения = Новый ХранилищеЗначения(Неопределено);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
	
	// Для исходящих квитанций дата совпадает с датой создания:
	Если Не ЗначениеЗаполнено(ИсходящаяДата) И Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда
		ИсходящаяДата = Дата;
	КонецЕсли;
	
	
	Если Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда
		Если Не ЗначениеЗаполнено(ИдентификаторКвитанции) Тогда
			Если ЭтоНовый() Тогда
				СсылкаНового = МЭДОПереопределяемый.СсылкаНовогоОбъекта(ЭтотОбъект);
				ИдентификаторКвитанции = "" + СсылкаНового.УникальныйИдентификатор();
			Иначе
				ИдентификаторКвитанции = "" + Ссылка.УникальныйИдентификатор();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// для исходящей квитанции - идентификатор входящего документа, с которым он пришел, или идентификатор входящего
	// уведомления.
	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
	
		Документ = ДокументПоПредметуКвитанции(Предмет);
		НаправлениеДокумента = Перечисления.НаправленияСообщенийМЭДО.НаправлениеДокумента(Документ);
		Если НаправлениеДокумента = Перечисления.НаправленияСообщенийМЭДО.Входящее Тогда
			СтруктураСостояния = РегистрыСведений.СостоянияДокументовМЭДО.СостояниеДокумента(
				Документ,
				Перечисления.СостоянияДокументовМЭДО.ДокументПолучен,
				"ИдентификаторСообщения",
				Дата);
			ИдентификаторСообщения = СтруктураСостояния.ИдентификаторСообщения;
		ИначеЕсли НаправлениеДокумента = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда 
			СтруктураСостояния = РегистрыСведений.СостоянияДокументовМЭДО.СостояниеДокумента(
				Документ,
				Перечисления.СостоянияДокументовМЭДО.ДокументОтправлен,
				"ИдентификаторСообщения",
				Дата);
			ИдентификаторСообщения = СтруктураСостояния.ИдентификаторСообщения;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СостоянияДокументовМЭДО.Записывать = Истина;
	
	Движение = Движения.СостоянияДокументовМЭДО.Добавить();
	Движение.Период = Дата;
	Движение.ПредметСообщения = Ссылка;
	Движение.Документ = ДокументПоПредметуКвитанции(Предмет);
	// Направление в регистре определяется по документу:
	Движение.Направление = Перечисления.НаправленияСообщенийМЭДО.НаправлениеДокумента(Движение.Документ);
	Движение.ИдентификаторСообщения = ИдентификаторСообщения;
	
	Если Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда
		
		// исходящая квитанция на входящий документ/входящее уведомление:
		Если Отправлена Тогда
			Если ЗначениеЗаполнено(КодОшибки) Или ЗначениеЗаполнено(КомментарийОшибки) Тогда
				Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ОтправленаКвитанцияОбОшибке;
			Иначе
				Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ОтправленаКвитанция;
			КонецЕсли;
		ИначеЕсли ГотоваКОтправке Тогда
			Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ИсходящаяКвитанцияЕщеНеОтправлена;
		Иначе
			Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.СозданаИсходящаяКвитанция;
		КонецЕсли;
		
	ИначеЕсли Направление = Перечисления.НаправленияСообщенийМЭДО.Входящее Тогда
		
		Движение.ИдентификаторДокумента = "";// не играет роли. 
		
		// Входящая квитанция на исходящий документ/исходящее уведомление:
		Если СообщениеПринято Тогда
			Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ПолученаКвитанция;
		Иначе
			Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ПолученаКвитанцияОбОшибке;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДокументПоПредметуКвитанции(Предмет)

	Если ТипЗнч(Предмет) = Тип("ДокументСсылка.УведомлениеМЭДО") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Предмет, "Документ");
	Иначе
		Возврат Предмет;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
